[
    {
        "word": "pusillanimous",
        "type": "adj",
        "definition": "showing a lack of courage or determination; timid",
        "cefr_level": "C2+",
        "examples": [
            "The pusillanimous soldier abandoned his post at the first sign of conflict.",
            "It was a pusillanimous decision by the board to avoid addressing the core issues.",
            "He was too pusillanimous to stand up to his bullying boss."
        ]
    },
    {
        "word": "lugubrious",
        "type": "adj",
        "definition": "looking or sounding sad and dismal",
        "cefr_level": "C2+",
        "examples": [
            "The lugubrious music at the funeral brought tears to everyone's eyes.",
            "Why the lugubrious face? You just won the lottery!",
            "The novel captures the lugubrious atmosphere of a decaying industrial town."
        ]
    },
    {
        "word": "intransigent",
        "type": "adj",
        "definition": "unwilling or refusing to change one's views or to agree about something",
        "cefr_level": "C2+",
        "examples": [
            "The union leader remained intransigent in his demand for higher wages.",
            "Her intransigent attitude made compromise impossible during the negotiations.",
            "Despite the overwhelming evidence, he maintained an intransigent denial of guilt."
        ]
    },
    {
        "word": "obsequious",
        "type": "adj",
        "definition": "obedient or attentive to an excessive or servile degree",
        "cefr_level": "C2+",
        "examples": [
            "The waiter was obsequious, constantly bowing and scraping to the wealthy patrons.",
            "She despised the obsequious flattery of her assistants.",
            "His obsequious behavior towards the CEO was embarrassing to watch."
        ]
    },
    {
        "word": "truculent",
        "type": "adj",
        "definition": "eager or quick to argue or fight; aggressively defiant",
        "cefr_level": "C2+",
        "examples": [
            "His truculent demeanor suggests he is looking for a fight.",
            "The truculent criticism from the opposition party stalled the bill.",
            "After a few drinks, he became truculent and started shouting at the bartender."
        ]
    },
    {
        "word": "crepuscular",
        "type": "adj",
        "definition": "resembling or relating to twilight; dim or indistinct",
        "cefr_level": "C2+",
        "examples": [
            "Many predators are crepuscular, hunting primarily at dawn and dusk.",
            "We walked through the crepuscular gloom of the old forest.",
            "The painting captured the crepuscular light fading over the harbor."
        ]
    },
    {
        "word": "quixotic",
        "type": "adj",
        "definition": "exceedingly idealistic; unrealistic and impractical",
        "cefr_level": "C2+",
        "examples": [
            "His quixotic plan to build a utopia on a desert island failed miserably.",
            "It was a quixotic quest to find the lost city without a map.",
            "She realized that her quixotic dreams of changing the world overnight were naive."
        ]
    },
    {
        "word": "insouciant",
        "type": "adj",
        "definition": "showing a casual lack of concern; indifferent",
        "cefr_level": "C2+",
        "examples": [
            "He wandered into the meeting with an insouciant smile, ignoring the tension.",
            "Her insouciant attitude toward her exams worried her parents.",
            "Despite the looming deadline, he remained maddeningly insouciant."
        ]
    },
    {
        "word": "perfidious",
        "type": "adj",
        "definition": "deceitful and untrustworthy",
        "cefr_level": "C2+",
        "examples": [
            "The perfidious ally betrayed his country for money.",
            "She eventually saw through his perfidious charm.",
            "History is full of stories about perfidious lovers and tragic endings."
        ]
    },
    {
        "word": "querulous",
        "type": "adj",
        "definition": "complaining in a petulant or whining manner",
        "cefr_level": "C2+",
        "examples": [
            "The querulous customer demanded to speak to the manager for the third time.",
            "His querulous voice grated on my nerves during the long car ride.",
            "She became increasingly querulous in her old age, finding fault with everything."
        ]
    },
    {
        "word": "fractious",
        "type": "adj",
        "definition": "irritable and quarrelsome (typically of children or groups)",
        "cefr_level": "C2+",
        "examples": [
            "The fractious crowd began to push against the police barricades.",
            "The exhausted children became fractious after hours of shopping.",
            "Political infighting has led to a fractious parliament."
        ]
    },
    {
        "word": "sedulous",
        "type": "adj",
        "definition": "showing dedication and diligence",
        "cefr_level": "C2+",
        "examples": [
            "He was a sedulous student, spending every night in the library.",
            "The sedulous care she took with her garden resulted in prize-winning roses.",
            "Through sedulous research, the journalist uncovered the corruption scandal."
        ]
    },
    {
        "word": "effulgent",
        "type": "adj",
        "definition": "shining brightly; radiant",
        "cefr_level": "C2+",
        "examples": [
            "The bride looked effulgent in her white gown.",
            "The effulgent sunrise painted the sky in shades of gold and pink.",
            "Her effulgent personality lights up every room she enters."
        ]
    },
    {
        "word": "tenebrous",
        "type": "adj",
        "definition": "dark; shadowy or obscure",
        "cefr_level": "C2+",
        "examples": [
            "The tenebrous corners of the castle were filled with cobwebs.",
            "He has a tenebrous past that he refuses to discuss.",
            "The movie's tenebrous cinematography added to the suspense."
        ]
    },
    {
        "word": "supercilious",
        "type": "adj",
        "definition": "behaving or looking as though one thinks one is superior to others",
        "cefr_level": "C2+",
        "examples": [
            "The supercilious art critic dismissed the painting with a wave of his hand.",
            "I can't stand his supercilious smirk whenever he corrects someone.",
            "She gave him a supercilious glance before turning away."
        ]
    },
    {
        "word": "jejune",
        "type": "adj",
        "definition": "naive, simplistic, and superficial; dry and uninteresting",
        "cefr_level": "C2+",
        "examples": [
            "His jejune lecture on philosophy bored the students to tears.",
            "The politician's jejune remarks revealed his lack of understanding.",
            "Critics panned the movie as a jejune attempt at satire."
        ]
    },
    {
        "word": "parsimonious",
        "type": "adj",
        "definition": "unwilling to spend money or use resources; stingy or frugal",
        "cefr_level": "C2+",
        "examples": [
            "The parsimonious old man refused to turn on the heating even in winter.",
            "Her parsimonious nature allowed her to save a fortune over the years.",
            "The government's parsimonious funding for education has led to protests."
        ]
    },
    {
        "word": "sententious",
        "type": "adj",
        "definition": "given to moralizing in a pompous or affected manner",
        "cefr_level": "C2+",
        "examples": [
            "I found his sententious speech about family values hypocritical.",
            "The book is full of sententious dialogue that feels unnatural.",
            "Stop being so sententious and just tell me what you think."
        ]
    },
    {
        "word": "propinquity",
        "type": "adj",
        "definition": "the state of being close to someone or something; proximity",
        "cefr_level": "C2+",
        "examples": [
            "The propinquity of the two houses led to a close friendship between the families.",
            "Their marriage was due more to propinquity than passion.",
            "The propinquity of the danger made everyone nervous."
        ]
    },
    {
        "word": "meretricious",
        "type": "adj",
        "definition": "apparently attractive but having in reality no value or integrity",
        "cefr_level": "C2+",
        "examples": [
            "The souvenir shop was full of meretricious trinkets.",
            "He dismissed the argument as meretricious and lacking substance.",
            "Her meretricious beauty faded as soon as she opened her mouth."
        ]
    },
    {
        "word": "saturnine",
        "type": "adj",
        "definition": "slow and gloomy; dark in coloring and moody or mysterious",
        "cefr_level": "C2+",
        "examples": [
            "His saturnine countenance suggested deep melancholy.",
            "The saturnine character in the play rarely spoke but had a commanding presence.",
            "A saturnine mood settled over the team after the defeat."
        ]
    },
    {
        "word": "bilious",
        "type": "adj",
        "definition": "affected by or associated with nausea or vomiting; spiteful; bad-tempered",
        "cefr_level": "C2+",
        "examples": [
            "The bilious green color of the walls made me feel sick.",
            "He wrote a bilious review of the restaurant.",
            "Her bilious temperament made her difficult to work with."
        ]
    },
    {
        "word": "sanguine",
        "type": "adj",
        "definition": "optimistic or positive, especially in an apparently bad or difficult situation",
        "cefr_level": "C2+",
        "examples": [
            "Despite the economic downturn, he remains sanguine about the company's future.",
            "She has a sanguine disposition that charms everyone.",
            "I am not as sanguine as you are about the outcome of the election."
        ]
    },
    {
        "word": "phlegmatic",
        "type": "adj",
        "definition": "having an unemotional and stolidly calm disposition",
        "cefr_level": "C2+",
        "examples": [
            "The phlegmatic British character is often portrayed in movies.",
            "He remained phlegmatic even when the fire alarm went off.",
            "Her phlegmatic response to the crisis calmed everyone down."
        ]
    },
    {
        "word": "choleric",
        "type": "adj",
        "definition": "bad-tempered or irritable",
        "cefr_level": "C2+",
        "examples": [
            "The choleric old general shouted at his subordinates.",
            "Avoid discussing politics with him; he has a choleric nature.",
            "His choleric outbursts were legendary in the office."
        ]
    },
    {
        "word": "mellifluous",
        "type": "adj",
        "definition": "(of a voice or words) sweet or musical; pleasant to hear",
        "cefr_level": "C2+",
        "examples": [
            "She had a rich, mellifluous voice that captivated the audience.",
            "The mellifluous tones of the cello filled the room.",
            "His speech was a mellifluous flow of compliments."
        ]
    },
    {
        "word": "cacophonous",
        "type": "adj",
        "definition": "involving or producing a harsh, discordant mixture of sounds",
        "cefr_level": "C2+",
        "examples": [
            "The cacophonous sounds of the construction site gave me a headache.",
            "A cacophonous argument erupted in the parliament.",
            "The band's performance was a cacophonous mess."
        ]
    },
    {
        "word": "strident",
        "type": "adj",
        "definition": "loud and harsh; grating",
        "cefr_level": "C2+",
        "examples": [
            "Her strident voice pierced through the noise of the crowd.",
            "The group issued a strident statement condemning the policy.",
            "I was put off by his strident criticism of the plan."
        ]
    },
    {
        "word": "vociferous",
        "type": "adj",
        "definition": "(especially of a person or speech) vehement or clamorous",
        "cefr_level": "C2+",
        "examples": [
            "He was a vociferous opponent of the new law.",
            "The vociferous protests forced the government to reconsider.",
            "She is vociferous in her defense of animal rights."
        ]
    },
    {
        "word": "euphonious",
        "type": "adj",
        "definition": "(of sound, especially speech) pleasing to the ear",
        "cefr_level": "C2+",
        "examples": [
            "The poet chose words that were euphonious and rhythmic.",
            "It is a euphonious name, pleasant to say and hear.",
            "The euphonious melody lulled the baby to sleep."
        ]
    },
    {
        "word": "ephemeral",
        "type": "adj",
        "definition": "lasting for a very short time",
        "cefr_level": "C2+",
        "examples": [
            "Fashions are ephemeral, changing with every passing season.",
            "She captured the ephemeral beauty of a snowflake in her photograph.",
            "His fame proved to be ephemeral, vanishing as quickly as it had arrived."
        ]
    },
    {
        "word": "evanescent",
        "type": "adj",
        "definition": "soon passing out of sight, memory, or existence; quickly fading or disappearing",
        "cefr_level": "C2+",
        "examples": [
            "A shimmering, evanescent bubble floated in the air before bursting.",
            "The beauty of the sunset was evanescent, lasting only a few minutes.",
            "He tried to grasp the evanescent memory of his dream before it slipped away."
        ]
    },
    {
        "word": "perennial",
        "type": "adj",
        "definition": "lasting or existing for a long or apparently infinite time; enduring",
        "cefr_level": "C2+",
        "examples": [
            "The novel tackles the perennial conflict between individual freedom and social responsibility.",
            "Lack of funding is a perennial problem for the arts.",
            "She planted perennial flowers so they would bloom year after year."
        ]
    },
    {
        "word": "inveterate",
        "type": "adj",
        "definition": "having a particular habit, activity, or interest that is long-established and unlikely to change",
        "cefr_level": "C2+",
        "examples": [
            "He is an inveterate liar; you simply cannot trust anything he says.",
            "As an inveterate traveler, she has visited over fifty countries.",
            "The inveterate hostility between the two nations has lasted for centuries."
        ]
    },
    {
        "word": "invidious",
        "type": "adj",
        "definition": "(of an action or situation) likely to arouse or incur resentment or anger in others",
        "cefr_level": "C2+",
        "examples": [
            "She was put in the invidious position of having to choose between her friend and her career.",
            "Making invidious comparisons between the two students only discouraged them both.",
            "The policy created an invidious distinction between full-time and part-time employees."
        ]
    },
    {
        "word": "odious",
        "type": "adj",
        "definition": "extremely unpleasant; repulsive",
        "cefr_level": "C2+",
        "examples": [
            "The dictator was responsible for some of the most odious crimes in history.",
            "He had the odious habit of picking his teeth in public.",
            "I find his hypocrisy absolutely odious."
        ]
    },
    {
        "word": "deleterious",
        "type": "adj",
        "definition": "causing harm or damage",
        "cefr_level": "C2+",
        "examples": [
            "The chemical has a deleterious effect on the ozone layer.",
            "Lack of sleep can have a deleterious impact on your cognitive performance.",
            "The deleterious consequences of the decision were not immediately apparent."
        ]
    },
    {
        "word": "salubrious",
        "type": "adj",
        "definition": "health-giving; healthy",
        "cefr_level": "C2+",
        "examples": [
            "The salubrious mountain air did wonders for his recovery.",
            "They moved to a more salubrious neighborhood away from the industrial smog.",
            "The diet had a salubrious effect on his overall well-being."
        ]
    },
    {
        "word": "salutary",
        "type": "adj",
        "definition": "(especially with reference to something unwelcome or unpleasant) producing good effects; beneficial",
        "cefr_level": "C2+",
        "examples": [
            "The accident was a salutary reminder of the importance of wearing seatbelts.",
            "The strict discipline had a salutary effect on the unruly class.",
            "It was a salutary lesson in the dangers of overconfidence."
        ]
    },
    {
        "word": "desultory",
        "type": "adj",
        "definition": "lacking a plan, purpose, or enthusiasm",
        "cefr_level": "C2+",
        "examples": [
            "They had a desultory conversation while waiting for the bus.",
            "He made a desultory attempt to clean his room but gave up after five minutes.",
            "The investigation was desultory and failed to uncover any real evidence."
        ]
    },
    {
        "word": "cursory",
        "type": "adj",
        "definition": "hasty and therefore not thorough or detailed",
        "cefr_level": "C2+",
        "examples": [
            "He gave the report a cursory glance before signing it.",
            "A cursory inspection of the vehicle revealed no obvious defects.",
            "She made a cursory apology, clearly not meaning a word of it."
        ]
    },
    {
        "word": "discursive",
        "type": "adj",
        "definition": "digressing from subject to subject",
        "cefr_level": "C2+",
        "examples": [
            "His writing style is discursive, often wandering into unrelated anecdotes.",
            "The professor's discursive lecture was interesting but hard to follow.",
            "She wrote a discursive essay that touched on philosophy, art, and history."
        ]
    },
    {
        "word": "perfunctory",
        "type": "adj",
        "definition": "(of an action or gesture) carried out with a minimum of effort or reflection",
        "cefr_level": "C2+",
        "examples": [
            "He gave a perfunctory nod to his colleague as he passed in the hall.",
            "The security check was perfunctory, and we were through in seconds.",
            "She made a perfunctory attempt to hide her disappointment."
        ]
    },
    {
        "word": "assiduous",
        "type": "adj",
        "definition": "showing great care and perseverance",
        "cefr_level": "C2+",
        "examples": [
            "She was assiduous in her duties, never missing a deadline.",
            "The project was completed on time thanks to the assiduous efforts of the team.",
            "He paid assiduous attention to detail in restoring the antique painting."
        ]
    },
    {
        "word": "indefatigable",
        "type": "adj",
        "definition": "(of a person or their efforts) persisting tirelessly",
        "cefr_level": "C2+",
        "examples": [
            "He is an indefatigable campaigner for human rights.",
            "Her indefatigable spirit kept the team motivated during the crisis.",
            "Despite his age, he remains an indefatigable worker."
        ]
    },
    {
        "word": "indomitable",
        "type": "adj",
        "definition": "impossible to subdue or defeat",
        "cefr_level": "C2+",
        "examples": [
            "Her indomitable will helped her survive the ordeal.",
            "The team showed indomitable courage in the face of adversity.",
            "He has an indomitable optimism that nothing can crush."
        ]
    },
    {
        "word": "recalcitrant",
        "type": "adj",
        "definition": "having an obstinately uncooperative attitude toward authority or discipline",
        "cefr_level": "C2+",
        "examples": [
            "The recalcitrant student refused to follow the teacher's instructions.",
            "The administration struggled to govern the recalcitrant province.",
            "It took hours to fix the recalcitrant machinery."
        ]
    },
    {
        "word": "obdurate",
        "type": "adj",
        "definition": "stubbornly refusing to change one's opinion or course of action",
        "cefr_level": "C2+",
        "examples": [
            "Despite her pleas, he remained obdurate and refused to forgive her.",
            "The obdurate refusal of the company to negotiate led to a strike.",
            "She was obdurate in her belief that she had done the right thing."
        ]
    },
    {
        "word": "obstinate",
        "type": "adj",
        "definition": "stubbornly refusing to change one's opinion or chosen course of action",
        "cefr_level": "C2+",
        "examples": [
            "He can be very obstinate when he thinks he is right.",
            "The obstinate stain on the carpet refused to come out.",
            "Her obstinate silence frustrated the investigators."
        ]
    },
    {
        "word": "tractable",
        "type": "adj",
        "definition": "(of a person or problem) easy to control or influence",
        "cefr_level": "C2+",
        "examples": [
            "The problem turned out to be more tractable than we initially thought.",
            "We need a tractable workforce that is willing to learn new skills.",
            "Global warming is not a tractable issue that can be solved by one country alone."
        ]
    },
    {
        "word": "docile",
        "type": "adj",
        "definition": "ready to accept control or instruction; submissive",
        "cefr_level": "C2+",
        "examples": [
            "The once wild horse had become docile and obedient.",
            "He wanted a docile assistant who wouldn't question his decisions.",
            "The population remained docile despite the harsh new laws."
        ]
    },
    {
        "word": "amenable",
        "type": "adj",
        "definition": "(of a person) open and responsive to suggestion; easily persuaded or controlled",
        "cefr_level": "C2+",
        "examples": [
            "She was amenable to the idea of changing the meeting time.",
            "The data is not amenable to simple analysis.",
            "We found him amenable to reason once he calmed down."
        ]
    },
    {
        "word": "malleable",
        "type": "adj",
        "definition": "easily influenced; pliable",
        "cefr_level": "C2+",
        "examples": [
            "Young minds are malleable and easily shaped by their environment.",
            "Gold is a highly malleable metal.",
            "The politician's malleable principles changed with the polls."
        ]
    },
    {
        "word": "diaphanous",
        "type": "adj",
        "definition": "(especially of fabric) light, delicate, and translucent",
        "cefr_level": "C2+",
        "examples": [
            "She wore a diaphanous silk scarf that floated in the breeze.",
            "The diaphanous wings of the dragonfly shimmered in the sunlight.",
            "His diaphanous excuses were easily seen through."
        ]
    },
    {
        "word": "gossamer",
        "type": "adj",
        "definition": "used to refer to something very light, thin, and insubstantial or delicate",
        "cefr_level": "C2+",
        "examples": [
            "The spider web was like gossamer in the morning dew.",
            "She has a gossamer memory of her early childhood.",
            "The plot of the movie was held together by gossamer threads."
        ]
    },
    {
        "word": "limpid",
        "type": "adj",
        "definition": "(of a liquid) free of anything that darkens; completely clear",
        "cefr_level": "C2+",
        "examples": [
            "We could see the fish swimming in the limpid waters of the pool.",
            "He writes in limpid prose that is a joy to read.",
            "Her limpid eyes revealed her innocence."
        ]
    },
    {
        "word": "pellucid",
        "type": "adj",
        "definition": "translucently clear",
        "cefr_level": "C2+",
        "examples": [
            "The pellucid water of the tropical bay was inviting.",
            "He gave a pellucid explanation of the complex scientific theory.",
            "Her singing voice was pellucid and pure."
        ]
    },
    {
        "word": "turbid",
        "type": "adj",
        "definition": "(of a liquid) cloudy, opaque, or thick with suspended matter",
        "cefr_level": "C2+",
        "examples": [
            "The river became turbid after the heavy storm.",
            "His turbid writing style makes his arguments difficult to understand.",
            "She tried to clear her turbid thoughts."
        ]
    },
    {
        "word": "opaque",
        "type": "adj",
        "definition": "not able to be seen through; not transparent",
        "cefr_level": "C2+",
        "examples": [
            "The windows were opaque with steam.",
            "The company's accounting practices are completely opaque to outsiders.",
            "I found his instructions opaque and confusing."
        ]
    },
    {
        "word": "arcane",
        "type": "adj",
        "definition": "understood by few; mysterious or secret",
        "cefr_level": "C2+",
        "examples": [
            "He has a knowledge of arcane legal procedures that is unmatched.",
            "The rituals of the secret society were arcane and bizarre.",
            "Modern banking systems can seem arcane to the average person."
        ]
    },
    {
        "word": "diaphanous",
        "type": "adj",
        "definition": "(especially of fabric) light, delicate, and translucent",
        "cefr_level": "C2+",
        "examples": [
            "She wore a diaphanous silk scarf that floated in the breeze.",
            "The diaphanous wings of the dragonfly shimmered in the sunlight.",
            "His diaphanous excuses were easily seen through by the committee."
        ]
    },
    {
        "word": "gossamer",
        "type": "adj",
        "definition": "used to refer to something very light, thin, and insubstantial or delicate",
        "cefr_level": "C2+",
        "examples": [
            "The spider web was like gossamer in the morning dew.",
            "She has a gossamer memory of her early childhood, vague and dreamlike.",
            "The plot of the movie was held together by gossamer threads of logic."
        ]
    },
    {
        "word": "limpid",
        "type": "adj",
        "definition": "(of a liquid) free of anything that darkens; completely clear",
        "cefr_level": "C2+",
        "examples": [
            "We could see the fish swimming in the limpid waters of the tropical pool.",
            "He writes in limpid prose that makes complex ideas easy to grasp.",
            "Her limpid eyes revealed her innocence and sincerity."
        ]
    },
    {
        "word": "pellucid",
        "type": "adj",
        "definition": "translucently clear; easily understood",
        "cefr_level": "C2+",
        "examples": [
            "The pellucid water of the bay invited us to dive in.",
            "He gave a pellucid explanation of the complex scientific theory.",
            "Her singing voice was pellucid, pure, and hauntingly beautiful."
        ]
    },
    {
        "word": "turbid",
        "type": "adj",
        "definition": "(of a liquid) cloudy, opaque, or thick with suspended matter; confused or obscure in meaning",
        "cefr_level": "C2+",
        "examples": [
            "The river became turbid and brown after the heavy storm.",
            "His turbid writing style makes his arguments difficult to follow.",
            "She tried to clear her turbid thoughts after a sleepless night."
        ]
    },
    {
        "word": "arcane",
        "type": "adj",
        "definition": "understood by few; mysterious or secret",
        "cefr_level": "C2+",
        "examples": [
            "He has a knowledge of arcane legal procedures that is unmatched in the firm.",
            "The rituals of the secret society were arcane and bizarre to outsiders.",
            "Modern banking systems can seem arcane to the average person."
        ]
    },
    {
        "word": "recondite",
        "type": "adj",
        "definition": "(of a subject or knowledge) little known; abstruse",
        "cefr_level": "C2+",
        "examples": [
            "The book is full of recondite information about ancient civilizations.",
            "She enjoys studying recondite subjects like quantum mysticism.",
            "His references were so recondite that only a few scholars understood them."
        ]
    },
    {
        "word": "abstruse",
        "type": "adj",
        "definition": "difficult to understand; obscure",
        "cefr_level": "C2+",
        "examples": [
            "The philosopher's arguments were too abstruse for the general public.",
            "I found the technical manual completely abstruse.",
            "He has a talent for making abstruse concepts accessible to students."
        ]
    },
    {
        "word": "axiomatic",
        "type": "adj",
        "definition": "self-evident or unquestionable",
        "cefr_level": "C2+",
        "examples": [
            "It is axiomatic that life is not always fair.",
            "In geometry, certain truths are taken as axiomatic.",
            "The company operates on the axiomatic belief that the customer is always right."
        ]
    },
    {
        "word": "apocryphal",
        "type": "adj",
        "definition": "(of a story or statement) of doubtful authenticity, although widely circulated as being true",
        "cefr_level": "C2+",
        "examples": [
            "The story about George Washington and the cherry tree is likely apocryphal.",
            "Most of the rumors surrounding the celebrity are apocryphal.",
            "He told an apocryphal anecdote to illustrate his point."
        ]
    },
    {
        "word": "spurious",
        "type": "adj",
        "definition": "not being what it purports to be; false or fake",
        "cefr_level": "C2+",
        "examples": [
            "The court rejected the spurious claim of ownership.",
            "He was arrested for using spurious banknotes.",
            "There is a spurious correlation between ice cream sales and shark attacks."
        ]
    },
    {
        "word": "heterodox",
        "type": "adj",
        "definition": "not conforming with accepted or orthodox standards or beliefs",
        "cefr_level": "C2+",
        "examples": [
            "His heterodox views on economics challenged the established theories.",
            "She was criticized for her heterodox approach to teaching.",
            "The church has a long history of silencing heterodox opinions."
        ]
    },
    {
        "word": "iconoclastic",
        "type": "adj",
        "definition": "characterized by attack on cherished beliefs or institutions",
        "cefr_level": "C2+",
        "examples": [
            "The artist is known for his iconoclastic style that defies convention.",
            "His iconoclastic book questioned the foundations of modern democracy.",
            "She took an iconoclastic stance against the traditions of the university."
        ]
    },
    {
        "word": "boorish",
        "type": "adj",
        "definition": "rough and bad-mannered; coarse",
        "cefr_level": "C2+",
        "examples": [
            "His boorish behavior at the dinner party embarrassed his wife.",
            "We were appalled by the boorish comments of the hecklers.",
            "He was dismissed for his boorish treatment of the staff."
        ]
    },
    {
        "word": "churlish",
        "type": "adj",
        "definition": "rude in a mean-spirited and surly way",
        "cefr_level": "C2+",
        "examples": [
            "It would be churlish to refuse such a generous offer.",
            "He made a churlish remark about the gift.",
            "Her churlish attitude alienated her from her colleagues."
        ]
    },
    {
        "word": "uncouth",
        "type": "adj",
        "definition": "(of a person or their appearance or behavior) lacking good manners, refinement, or grace",
        "cefr_level": "C2+",
        "examples": [
            "He was an uncouth young man who ate with his mouth open.",
            "Her uncouth laughter drew stares from across the restaurant.",
            "Despite his wealth, his manners remained uncouth."
        ]
    },
    {
        "word": "urbane",
        "type": "adj",
        "definition": "(of a person, especially a man) suave, courteous, and refined in manner",
        "cefr_level": "C2+",
        "examples": [
            "The urbane diplomat charmed everyone at the reception.",
            "He maintained an urbane sophistication even under pressure.",
            "She was drawn to his urbane wit and polished manners."
        ]
    },
    {
        "word": "maladroit",
        "type": "adj",
        "definition": "ineffective or clumsy",
        "cefr_level": "C2+",
        "examples": [
            "His maladroit handling of the negotiations caused a diplomatic incident.",
            "Socially maladroit, he often says the wrong thing at the wrong time.",
            "The government's maladroit response to the disaster was widely criticized."
        ]
    },
    {
        "word": "gauche",
        "type": "adj",
        "definition": "lacking ease or grace; unsophisticated and socially awkward",
        "cefr_level": "C2+",
        "examples": [
            "It would be gauche to mention the price of the gift.",
            "He felt gauche and out of place at the high-society gala.",
            "Her gauche attempt at a compliment ended up sounding like an insult."
        ]
    },
    {
        "word": "feckless",
        "type": "adj",
        "definition": "lacking initiative or strength of character; irresponsible",
        "cefr_level": "C2+",
        "examples": [
            "He was a feckless parent who left the raising of his children to others.",
            "The feckless management drove the company into bankruptcy.",
            "Critics described the policy as a feckless attempt to solve a major crisis."
        ]
    },
    {
        "word": "indolent",
        "type": "adj",
        "definition": "wanting to avoid activity or exertion; lazy",
        "cefr_level": "C2+",
        "examples": [
            "The hot weather made everyone feel indolent.",
            "He was an indolent student who rarely did his homework.",
            "She spent an indolent afternoon reading by the pool."
        ]
    },
    {
        "word": "torpid",
        "type": "adj",
        "definition": "mentally or physically inactive; lethargic",
        "cefr_level": "C2+",
        "examples": [
            "The heat made the reptiles torpid and slow-moving.",
            "He fell into a torpid state after the heavy meal.",
            "The economy remained torpid despite the government's stimulus package."
        ]
    },
    {
        "word": "languid",
        "type": "adj",
        "definition": "(of a person, manner, or gesture) displaying or having a disinclination for physical exertion or effort; slow and relaxed",
        "cefr_level": "C2+",
        "examples": [
            "She gave a languid wave of her hand as the car drove away.",
            "They enjoyed a languid lunch on the terrace.",
            "His movements were languid, as if he had all the time in the world."
        ]
    },
    {
        "word": "lethargic",
        "type": "adj",
        "definition": "affected by lethargy; sluggish and apathetic",
        "cefr_level": "C2+",
        "examples": [
            "I felt lethargic and unable to concentrate all day.",
            "The patient became lethargic after taking the medication.",
            "The team's performance was lethargic and uninspired."
        ]
    },
    {
        "word": "somnolent",
        "type": "adj",
        "definition": "sleepy; drowsy",
        "cefr_level": "C2+",
        "examples": [
            "The lecture was so boring that it had a somnolent effect on the audience.",
            "We drove through a somnolent little village in the countryside.",
            "The heavy meal made him feel somnolent."
        ]
    },
    {
        "word": "vivacious",
        "type": "adj",
        "definition": "(especially of a woman) attractively lively and animated",
        "cefr_level": "C2+",
        "examples": [
            "She was a vivacious hostess who kept the party going.",
            "His vivacious personality makes him popular with everyone.",
            "The actress gave a vivacious performance in the lead role."
        ]
    },
    {
        "word": "efficacious",
        "type": "adj",
        "definition": "(typically of something inanimate or abstract) successful in producing a desired or intended result; effective",
        "cefr_level": "C2+",
        "examples": [
            "The new vaccine proved to be highly efficacious against the virus.",
            "Meditation is an efficacious way to reduce stress.",
            "They are looking for an efficacious solution to the traffic problem."
        ]
    },
    {
        "word": "ineffable",
        "type": "adj",
        "definition": "too great or extreme to be expressed or described in words",
        "cefr_level": "C2+",
        "examples": [
            "The ineffable beauty of the Grand Canyon left us speechless.",
            "She felt an ineffable joy when she held her newborn baby.",
            "The concept of god is often considered ineffable."
        ]
    },
    {
        "word": "nefarious",
        "type": "adj",
        "definition": "(typically of an action or activity) wicked or criminal",
        "cefr_level": "C2+",
        "examples": [
            "The villain hatched a nefarious plot to take over the world.",
            "He was involved in nefarious activities like drug trafficking.",
            "The investigation uncovered a nefarious scheme to defraud investors."
        ]
    },
    {
        "word": "egregious",
        "type": "adj",
        "definition": "outstandingly bad; shocking",
        "cefr_level": "C2+",
        "examples": [
            "It was an egregious error that cost the company millions.",
            "The dictator's egregious abuse of human rights was condemned by the UN.",
            "She claimed the article was an egregious misrepresentation of the facts."
        ]
    },
    {
        "word": "obfuscate",
        "type": "verb",
        "definition": "render obscure, unclear, or unintelligible",
        "cefr_level": "C2+",
        "examples": [
            "The politician used complex jargon to obfuscate the truth about the scandal.",
            "Badly written code can obfuscate the logic of the program, making it impossible to debug.",
            "She tried to obfuscate her real motives with a flurry of irrelevant details."
        ]
    },
    {
        "word": "prevaricate",
        "type": "verb",
        "definition": "speak or act in an evasive way",
        "cefr_level": "C2+",
        "examples": [
            "Stop prevaricating and give me a straight answer: yes or no?",
            "The witness began to prevaricate when asked about his whereabouts on the night of the crime.",
            "He has a tendency to prevaricate when he feels cornered or insecure."
        ]
    },
    {
        "word": "pontificate",
        "type": "verb",
        "definition": "express one's opinions in a way considered annoyingly pompous and dogmatic",
        "cefr_level": "C2+",
        "examples": [
            "He loves to pontificate about world politics, even though he's never left his hometown.",
            "The professor would pontificate for hours while the students struggled to stay awake.",
            "We don't need you to pontificate on morality; we need practical solutions."
        ]
    },
    {
        "word": "abscond",
        "type": "verb",
        "definition": "leave hurriedly and secretly, typically to avoid detection or arrest",
        "cefr_level": "C2+",
        "examples": [
            "The treasurer managed to abscond with the company's pension fund.",
            "Several prisoners attempted to abscond during the riot.",
            "He plans to abscond to a country with no extradition treaty."
        ]
    },
    {
        "word": "abrogate",
        "type": "verb",
        "definition": "repeal or do away with (a law, right, or formal agreement)",
        "cefr_level": "C2+",
        "examples": [
            "The new government promised to abrogate the oppressive laws of the previous regime.",
            "You cannot simply abrogate your responsibilities as a parent.",
            "The treaty was abrogated after the ceasefire violation."
        ]
    },
    {
        "word": "abjure",
        "type": "verb",
        "definition": "solemnly renounce (a belief, cause, or claim)",
        "cefr_level": "C2+",
        "examples": [
            "Under torture, he refused to abjure his faith.",
            "The defendant agreed to abjure his life of crime in exchange for a lighter sentence.",
            "She decided to abjure all worldly possessions and join a monastery."
        ]
    },
    {
        "word": "expurgate",
        "type": "verb",
        "definition": "remove matter thought to be objectionable or unsuitable from a text",
        "cefr_level": "C2+",
        "examples": [
            "The school library decided to expurgate the controversial passages from the classic novel.",
            "This is an expurgated version of the diary, with all the scandalous details removed.",
            "Editors often expurgate profanity from movies before they are shown on daytime TV."
        ]
    },
    {
        "word": "vituperate",
        "type": "verb",
        "definition": "blame or insult (someone) in strong or violent language",
        "cefr_level": "C2+",
        "examples": [
            "He began to vituperate the referee after the controversial call.",
            "The review did nothing but vituperate the director's artistic choices.",
            "It is unproductive to vituperate your employees instead of offering constructive criticism."
        ]
    },
    {
        "word": "excoriate",
        "type": "verb",
        "definition": "censure or criticize severely",
        "cefr_level": "C2+",
        "examples": [
            "The press proceeded to excoriate the mayor for his handling of the crisis.",
            "She was excoriated by the committee for her lack of preparation.",
            "His latest book excoriates the corruption within the banking system."
        ]
    },
    {
        "word": "fulminate",
        "type": "verb",
        "definition": "express vehement protest",
        "cefr_level": "C2+",
        "examples": [
            "The editorial fulminated against the proposed tax increases.",
            "He stood on the street corner, fulminating against the evils of modern society.",
            "It's easy to fulminate on social media, but harder to take real action."
        ]
    },
    {
        "word": "inculcate",
        "type": "verb",
        "definition": "instill (an attitude, idea, or habit) by persistent instruction",
        "cefr_level": "C2+",
        "examples": [
            "The coach worked hard to inculcate a winning mentality in the team.",
            "Parents try to inculcate values of honesty and respect in their children.",
            "Propaganda is often used to inculcate loyalty to the state."
        ]
    },
    {
        "word": "vacillate",
        "type": "verb",
        "definition": "alternate or waver between different opinions or actions; be indecisive",
        "cefr_level": "C2+",
        "examples": [
            "She continued to vacillate between accepting the job offer or staying in her current role.",
            "The stock market vacillated wildly throughout the day.",
            "Don't vacillate; make a decision and stick to it."
        ]
    },
    {
        "word": "masticate",
        "type": "verb",
        "definition": "chew (food)",
        "cefr_level": "C2+",
        "examples": [
            "It is important to masticate your food thoroughly for better digestion.",
            "The cows were peacefully masticating the grass in the field.",
            "The machine is designed to masticate waste material into smaller pieces."
        ]
    },
    {
        "word": "defenestrate",
        "type": "verb",
        "definition": "throw (someone) out of a window",
        "cefr_level": "C2+",
        "examples": [
            "In a fit of rage, he threatened to defenestrate his computer.",
            "The historical event known as the Defenestration of Prague involved rebels deciding to defenestrate the governors.",
            "Metaphorically, the voters decided to defenestrate the ruling party."
        ]
    },
    {
        "word": "circumambulate",
        "type": "verb",
        "definition": "walk all the way around (something)",
        "cefr_level": "C2+",
        "examples": [
            "Pilgrims circumambulate the temple three times as part of the ritual.",
            "We had to circumambulate the entire building to find the entrance.",
            "He circumambulated the issue without ever addressing the core problem."
        ]
    },
    {
        "word": "ameliorate",
        "type": "verb",
        "definition": "make (something bad or unsatisfactory) better",
        "cefr_level": "C2+",
        "examples": [
            "Strategies were introduced to ameliorate the negative effects of the crisis.",
            "She wanted to do something to ameliorate the suffering of the refugees.",
            "Only a significant financial investment can ameliorate the condition of the school."
        ]
    },
    {
        "word": "aggrandize",
        "type": "verb",
        "definition": "increase the power, status, or wealth of",
        "cefr_level": "C2+",
        "examples": [
            "The dictator sought to aggrandize himself by building massive statues.",
            "He embellished his resume to aggrandize his role in the project.",
            "The company's sole purpose seems to be to aggrandize its shareholders."
        ]
    },
    {
        "word": "gainsay",
        "type": "verb",
        "definition": "deny or contradict (a fact or statement)",
        "cefr_level": "C2+",
        "examples": [
            "It is impossible to gainsay the importance of this discovery.",
            "No one dared to gainsay the principal's decision.",
            "There is no gainsaying the fact that the economy is in trouble."
        ]
    },
    {
        "word": "promulgate",
        "type": "verb",
        "definition": "promote or make widely known (an idea or cause)",
        "cefr_level": "C2+",
        "examples": [
            "The new constitution was promulgated last week.",
            "He uses his blog to promulgate his conspiracy theories.",
            "The organization was formed to promulgate the benefits of a vegan diet."
        ]
    },
    {
        "word": "remonstrate",
        "type": "verb",
        "definition": "make a forcefully reproachful protest",
        "cefr_level": "C2+",
        "examples": [
            "I went to the boss to remonstrate against the unfair new rules.",
            "He remonstrated with the referee, but the yellow card stood.",
            "It is useless to remonstrate with someone who refuses to listen."
        ]
    },
    {
        "word": "vitiate",
        "type": "verb",
        "definition": "spoil or impair the quality or efficiency of",
        "cefr_level": "C2+",
        "examples": [
            "Development projects that vitiate the environment should be halted.",
            "A single technical error can vitiate the entire experiment.",
            "Malice in the negotiations vitiated the contract."
        ]
    },
    {
        "word": "lionize",
        "type": "verb",
        "definition": "give a lot of public attention and approval to (someone); treat as a celebrity",
        "cefr_level": "C2+",
        "examples": [
            "The media tends to lionize athletes while ignoring scientists.",
            "After the war, he was lionized as a national hero.",
            "She doesn't want to be lionized; she just wants to do her job."
        ]
    },
    {
        "word": "ostracize",
        "type": "verb",
        "definition": "exclude (someone) from a society or group",
        "cefr_level": "C2+",
        "examples": [
            "She was ostracized by the other students for telling on them.",
            "Whistleblowers are often ostracized by their former colleagues.",
            "In ancient Athens, citizens could vote to ostracize a dangerous politician."
        ]
    },
    {
        "word": "equivocate",
        "type": "verb",
        "definition": "use ambiguous language so as to conceal the truth or avoid committing oneself",
        "cefr_level": "C2+",
        "examples": [
            "When asked about the budget, the director started to equivocate.",
            "Don't equivocate with me; I need a clear answer.",
            "His tendency to equivocate makes him a frustrating person to interview."
        ]
    },
    {
        "word": "extol",
        "type": "verb",
        "definition": "praise enthusiastically",
        "cefr_level": "C2+",
        "examples": [
            "The health benefits of exercise are extolled by doctors everywhere.",
            "He couldn't stop extolling the virtues of his new car.",
            "The poem extols the beauty of the countryside."
        ]
    },
    {
        "word": "castigate",
        "type": "verb",
        "definition": "reprimand (someone) severely",
        "cefr_level": "C2+",
        "examples": [
            "The judge castigated the lawyers for their lack of preparation.",
            "He was castigated in the press for his insensitive remarks.",
            "She castigated herself for making such a stupid mistake."
        ]
    },
    {
        "word": "recapitulate",
        "type": "verb",
        "definition": "summarize and state again the main points of",
        "cefr_level": "C2+",
        "examples": [
            "To conclude, I will briefly recapitulate the main arguments.",
            "Let's recapitulate what we have agreed upon so far.",
            "The final chapter recapitulates the themes of the book."
        ]
    },
    {
        "word": "capitulate",
        "type": "verb",
        "definition": "cease to resist an opponent or an unwelcome demand; surrender",
        "cefr_level": "C2+",
        "examples": [
            "The army was forced to capitulate after weeks of siege.",
            "I refuse to capitulate to their unreasonable demands.",
            "Eventually, the parents capitulated and bought the child the toy."
        ]
    },
    {
        "word": "exonerate",
        "type": "verb",
        "definition": "(especially of an official body) absolve (someone) from blame for a fault or wrongdoing",
        "cefr_level": "C2+",
        "examples": [
            "DNA evidence was used to exonerate the innocent man.",
            "The report exonerated the crew from any responsibility for the accident.",
            "He hopes the investigation will completely exonerate him."
        ]
    },
    {
        "word": "expatiate",
        "type": "verb",
        "definition": "speak or write at length or in detail",
        "cefr_level": "C2+",
        "examples": [
            "She expatiated on her favorite topic for twenty minutes.",
            "He loves to expatiate upon the history of the Roman Empire.",
            "I won't expatiate on the technical details here."
        ]
    },
    {
        "word": "vitiate",
        "type": "verb",
        "definition": "spoil or impair the quality or efficiency of",
        "cefr_level": "C2+",
        "examples": [
            "Development projects that vitiate the environment should be halted.",
            "A single technical error can vitiate the entire experiment.",
            "Fraud in the inducement vitiated the contract, making it void."
        ]
    },
    {
        "word": "lionize",
        "type": "verb",
        "definition": "give a lot of public attention and approval to (someone); treat as a celebrity",
        "cefr_level": "C2+",
        "examples": [
            "The media tends to lionize tech billionaires while ignoring scientists.",
            "After the war, the returning general was lionized as a national hero.",
            "She doesn't want to be lionized; she just wants to do her research in peace."
        ]
    },
    {
        "word": "ostracize",
        "type": "verb",
        "definition": "exclude (someone) from a society or group",
        "cefr_level": "C2+",
        "examples": [
            "She was ostracized by her village for violating the ancient traditions.",
            "Whistleblowers are often unfairly ostracized by their former colleagues.",
            "In ancient Athens, citizens could vote to ostracize a dangerous politician for ten years."
        ]
    },
    {
        "word": "equivocate",
        "type": "verb",
        "definition": "use ambiguous language so as to conceal the truth or avoid committing oneself",
        "cefr_level": "C2+",
        "examples": [
            "When asked about the budget cuts, the director started to equivocate.",
            "Do not equivocate with me; I need a straight answer right now.",
            "His tendency to equivocate makes him a frustrating person to interview."
        ]
    },
    {
        "word": "extol",
        "type": "verb",
        "definition": "praise enthusiastically",
        "cefr_level": "C2+",
        "examples": [
            "The health benefits of Mediterranean diet are extolled by doctors everywhere.",
            "He couldn't stop extolling the virtues of his new electric car.",
            "The poem extols the beauty of the pastoral landscape."
        ]
    },
    {
        "word": "castigate",
        "type": "verb",
        "definition": "reprimand (someone) severely",
        "cefr_level": "C2+",
        "examples": [
            "The judge castigated the lawyers for their lack of preparation.",
            "He was castigated in the press for his insensitive remarks about the victims.",
            "She castigated herself for making such a foolish mistake."
        ]
    },
    {
        "word": "recapitulate",
        "type": "verb",
        "definition": "summarize and state again the main points of",
        "cefr_level": "C2+",
        "examples": [
            "To conclude, I will briefly recapitulate the main arguments of my thesis.",
            "Let's recapitulate what we have agreed upon so far before moving on.",
            "The final chapter recapitulates the themes of the book."
        ]
    },
    {
        "word": "exonerate",
        "type": "verb",
        "definition": "(especially of an official body) absolve (someone) from blame for a fault or wrongdoing",
        "cefr_level": "C2+",
        "examples": [
            "New DNA evidence was used to exonerate the man imprisoned for twenty years.",
            "The internal report exonerated the crew from any responsibility for the accident.",
            "He hopes the investigation will completely exonerate him from the fraud charges."
        ]
    },
    {
        "word": "expatiate",
        "type": "verb",
        "definition": "speak or write at length or in detail",
        "cefr_level": "C2+",
        "examples": [
            "She expatiated on her favorite topic, 19th-century literature, for twenty minutes.",
            "He loves to expatiate upon the history of the Roman Empire at dinner parties.",
            "I won't expatiate on the technical details here, as they are covered in the appendix."
        ]
    },
    {
        "word": "usurp",
        "type": "verb",
        "definition": "take (a position of power or importance) illegally or by force",
        "cefr_level": "C2+",
        "examples": [
            "The vice president attempted to usurp the CEO's authority.",
            "The rebels plotted to usurp the throne and install a military junta.",
            "He felt that the new manager was trying to usurp his role in the department."
        ]
    },
    {
        "word": "supplant",
        "type": "verb",
        "definition": "supersede and replace",
        "cefr_level": "C2+",
        "examples": [
            "Digital streaming has largely supplanted physical media like DVDs.",
            "She feared that the new technology would supplant human workers.",
            "Old traditions were gradually supplanted by modern customs."
        ]
    },
    {
        "word": "amalgamate",
        "type": "verb",
        "definition": "combine or unite to form one organization or structure",
        "cefr_level": "C2+",
        "examples": [
            "The two companies decided to amalgamate to increase their market share.",
            "The new recipe amalgamates traditional flavors with modern techniques.",
            "Different cultures amalgamated to create a unique society."
        ]
    },
    {
        "word": "coalesce",
        "type": "verb",
        "definition": "come together to form one mass or whole",
        "cefr_level": "C2+",
        "examples": [
            "The puddles coalesced into a small stream after the rain.",
            "Various opposition groups coalesced around a charismatic leader.",
            "His vague ideas finally coalesced into a concrete plan."
        ]
    },
    {
        "word": "bifurcate",
        "type": "verb",
        "definition": "divide into two branches or forks",
        "cefr_level": "C2+",
        "examples": [
            "The river bifurcates just before it reaches the sea.",
            "Public opinion on the issue has bifurcated into two extreme camps.",
            "The road bifurcates here; the left path leads to the village."
        ]
    },
    {
        "word": "oscillate",
        "type": "verb",
        "definition": "move or swing back and forth at a regular speed",
        "cefr_level": "C2+",
        "examples": [
            "The fan oscillated back and forth, cooling the room.",
            "Her mood oscillates between extreme happiness and deep depression.",
            "The stock market has been oscillating wildly in recent weeks."
        ]
    },
    {
        "word": "sequester",
        "type": "verb",
        "definition": "isolate or hide away",
        "cefr_level": "C2+",
        "examples": [
            "The jury was sequestered in a hotel to prevent outside influence.",
            "He sequestered himself in his study to finish his novel.",
            "Carbon capture technology aims to sequester carbon dioxide underground."
        ]
    },
    {
        "word": "malinger",
        "type": "verb",
        "definition": "exaggerate or feign illness in order to escape duty or work",
        "cefr_level": "C2+",
        "examples": [
            "The sergeant suspected the soldier was malingering to avoid the march.",
            "He was accused of malingering when he called in sick on a sunny Friday.",
            "Doctors are trained to spot patients who are malingering for medication."
        ]
    },
    {
        "word": "proselytize",
        "type": "verb",
        "definition": "convert or attempt to convert (someone) from one religion, belief, or opinion to another",
        "cefr_level": "C2+",
        "examples": [
            "He went to the remote village to proselytize for his church.",
            "I wish he wouldn't try to proselytize everyone to his political views.",
            "They were banned from proselytizing in the workplace."
        ]
    },
    {
        "word": "obviate",
        "type": "verb",
        "definition": "remove (a need or difficulty)",
        "cefr_level": "C2+",
        "examples": [
            "The new medical treatment obviates the need for surgery.",
            "A peaceful settlement would obviate the necessity of sending troops.",
            "His quick thinking obviated a potential disaster."
        ]
    },
    {
        "word": "expiate",
        "type": "verb",
        "definition": "atone for (guilt or sin)",
        "cefr_level": "C2+",
        "examples": [
            "He spent the rest of his life trying to expiate his past crimes.",
            "Pilgrims travel here to expiate their sins.",
            "No amount of money can expiate the harm he has caused."
        ]
    },
    {
        "word": "importune",
        "type": "verb",
        "definition": "harass (someone) persistently for or to do something",
        "cefr_level": "C2+",
        "examples": [
            "Beggars importuned the tourists for money.",
            "He importuned her for a date until she finally agreed.",
            "The lobbyists importuned the senator to vote against the bill."
        ]
    },
    {
        "word": "impugn",
        "type": "verb",
        "definition": "dispute the truth, validity, or honesty of (a statement or motive); call into question",
        "cefr_level": "C2+",
        "examples": [
            "I do not mean to impugn your integrity, but the numbers don't add up.",
            "The defense lawyer tried to impugn the witness's character.",
            "His motives were impugned by his political rivals."
        ]
    },
    {
        "word": "disparage",
        "type": "verb",
        "definition": "regard or represent as being of little worth",
        "cefr_level": "C2+",
        "examples": [
            "He tends to disparage the achievements of his colleagues.",
            "Do not disparage his efforts; he worked very hard on this.",
            "The critic disparaged the movie as a waste of time."
        ]
    },
    {
        "word": "denigrate",
        "type": "verb",
        "definition": "criticize unfairly; disparage",
        "cefr_level": "C2+",
        "examples": [
            "It is unprofessional to denigrate your competitors.",
            "The article denigrates the importance of the scientific discovery.",
            "She felt that her contributions were constantly denigrated by her boss."
        ]
    },
    {
        "word": "vilify",
        "type": "verb",
        "definition": "speak or write about in an abusively disparaging manner",
        "cefr_level": "C2+",
        "examples": [
            "The politician was vilified in the press for his scandalous behavior.",
            "He was unfairly vilified as a traitor.",
            "Why do you vilify him without knowing the full story?"
        ]
    },
    {
        "word": "calumniate",
        "type": "verb",
        "definition": "make false and defamatory statements about; slander",
        "cefr_level": "C2+",
        "examples": [
            "He was calumniated by his enemies in a vicious smear campaign.",
            "To calumniate an innocent man is a grave injustice.",
            "She sued the newspaper for calumniating her reputation."
        ]
    },
    {
        "word": "besmirch",
        "type": "verb",
        "definition": "damage the reputation of (someone or something) in the opinion of others",
        "cefr_level": "C2+",
        "examples": [
            "The scandal threatened to besmirch the family's good name.",
            "He denied the allegations, claiming they were an attempt to besmirch his character.",
            "Don't let one mistake besmirch your entire career."
        ]
    },
    {
        "word": "adulterate",
        "type": "verb",
        "definition": "render (something) poorer in quality by adding another substance, typically an inferior one",
        "cefr_level": "C2+",
        "examples": [
            "The company was fined for adulterating the milk with water.",
            "Do not adulterate the pure essential oil with cheap fillers.",
            "He refused to adulterate his artistic vision for commercial success."
        ]
    },
    {
        "word": "debase",
        "type": "verb",
        "definition": "reduce (something) in quality or value; degrade",
        "cefr_level": "C2+",
        "examples": [
            "Inflation has debased the currency.",
            "Commercialism has debased the true meaning of the holiday.",
            "He felt that begging would debase his dignity."
        ]
    },
    {
        "word": "subvert",
        "type": "verb",
        "definition": "undermine the power and authority of (an established system or institution)",
        "cefr_level": "C2+",
        "examples": [
            "The plot to subvert the government was uncovered by the intelligence agency.",
            "The novel subverts traditional gender roles.",
            "They were accused of trying to subvert the democratic process."
        ]
    },
    {
        "word": "recondite",
        "type": "adj",
        "definition": "(of a subject or knowledge) little known; abstruse",
        "cefr_level": "C2+",
        "examples": [
            "The book touches on recondite areas of quantum physics that few understand.",
            "She has a talent for explaining recondite philosophical concepts in simple terms.",
            "The library is famous for its collection of recondite manuscripts."
        ]
    },
    {
        "word": "abstruse",
        "type": "adj",
        "definition": "difficult to understand; obscure",
        "cefr_level": "C2+",
        "examples": [
            "His arguments were so abstruse that even the experts were confused.",
            "I gave up trying to read the abstruse legal document.",
            "The professor's lectures are brilliant but often abstruse."
        ]
    },
    {
        "word": "axiomatic",
        "type": "adj",
        "definition": "self-evident or unquestionable",
        "cefr_level": "C2+",
        "examples": [
            "It is an axiomatic truth that violence begets violence.",
            "In this organization, customer satisfaction is taken as axiomatic.",
            "He challenged the axiomatic assumptions of the scientific community."
        ]
    },
    {
        "word": "apocryphal",
        "type": "adj",
        "definition": "(of a story or statement) of doubtful authenticity, although widely circulated as being true",
        "cefr_level": "C2+",
        "examples": [
            "The story of the alligator in the sewers is likely apocryphal.",
            "He told an amusing, though probably apocryphal, anecdote about the celebrity.",
            "Historians dismiss the document as apocryphal."
        ]
    },
    {
        "word": "spurious",
        "type": "adj",
        "definition": "not being what it purports to be; false or fake",
        "cefr_level": "C2+",
        "examples": [
            "The politician dismissed the allegations as spurious and politically motivated.",
            "He was arrested for attempting to pass spurious currency.",
            "There is often a spurious correlation between two unrelated events."
        ]
    },
    {
        "word": "heterodox",
        "type": "adj",
        "definition": "not conforming with accepted or orthodox standards or beliefs",
        "cefr_level": "C2+",
        "examples": [
            "His heterodox economic theories were initially rejected by the establishment.",
            "She has a heterodox approach to medicine that combines different traditions.",
            "The group was persecuted for its heterodox religious views."
        ]
    },
    {
        "word": "iconoclastic",
        "type": "adj",
        "definition": "characterized by attack on cherished beliefs or institutions",
        "cefr_level": "C2+",
        "examples": [
            "The filmmaker is known for his iconoclastic style that breaks all the rules.",
            "Her iconoclastic speech questioned the very foundations of the university.",
            "He became an iconoclastic figure in the art world."
        ]
    },
    {
        "word": "boorish",
        "type": "adj",
        "definition": "rough and bad-mannered; coarse",
        "cefr_level": "C2+",
        "examples": [
            "We were appalled by his boorish behavior at the wedding.",
            "He lost the contract due to his boorish treatment of the client.",
            "Ignorance is no excuse for being boorish."
        ]
    },
    {
        "word": "churlish",
        "type": "adj",
        "definition": "rude in a mean-spirited and surly way",
        "cefr_level": "C2+",
        "examples": [
            "It would be churlish to complain about the free meal.",
            "He refused the invitation with a churlish note.",
            "Her churlish attitude made her very unpopular in the office."
        ]
    },
    {
        "word": "uncouth",
        "type": "adj",
        "definition": "lacking good manners, refinement, or grace",
        "cefr_level": "C2+",
        "examples": [
            "He was an uncouth young man who had clearly never been taught table manners.",
            "Her uncouth language shocked the conservative audience.",
            "They considered the locals to be uncouth and uneducated."
        ]
    },
    {
        "word": "urbane",
        "type": "adj",
        "definition": "(of a person, especially a man) suave, courteous, and refined in manner",
        "cefr_level": "C2+",
        "examples": [
            "The urbane diplomat moved effortlessly through the crowded room.",
            "He is known for his urbane wit and sophisticated charm.",
            "In the city, he adopted an urbane lifestyle very different from his rural upbringing."
        ]
    },
    {
        "word": "debonair",
        "type": "adj",
        "definition": "(of a man) confident, stylish, and charming",
        "cefr_level": "C2+",
        "examples": [
            "He looked debonair in his tuxedo and bow tie.",
            "The actor played a debonair spy who saves the world.",
            "With a debonair smile, he ordered a martini."
        ]
    },
    {
        "word": "maladroit",
        "type": "adj",
        "definition": "ineffective or clumsy",
        "cefr_level": "C2+",
        "examples": [
            "His maladroit attempt to apologize only made things worse.",
            "Socially maladroit, he struggled to make conversation at the party.",
            "The government's maladroit handling of the economy led to a recession."
        ]
    },
    {
        "word": "gauche",
        "type": "adj",
        "definition": "lacking ease or grace; unsophisticated and socially awkward",
        "cefr_level": "C2+",
        "examples": [
            "It would be gauche to ask how much money he makes.",
            "She felt gauche and unsophisticated among the wealthy guests.",
            "His gauche remarks silenced the room."
        ]
    },
    {
        "word": "feckless",
        "type": "adj",
        "definition": "lacking initiative or strength of character; irresponsible",
        "cefr_level": "C2+",
        "examples": [
            "He is a feckless dreamer who never finishes what he starts.",
            "The project failed due to feckless leadership.",
            "She finally left her feckless husband."
        ]
    },
    {
        "word": "indolent",
        "type": "adj",
        "definition": "wanting to avoid activity or exertion; lazy",
        "cefr_level": "C2+",
        "examples": [
            "The hot summer afternoon made everyone feel indolent.",
            "He was an indolent heir who spent his days lounging by the pool.",
            "The indolent bureaucracy took months to process the application."
        ]
    },
    {
        "word": "torpid",
        "type": "adj",
        "definition": "mentally or physically inactive; lethargic",
        "cefr_level": "C2+",
        "examples": [
            "The hibernation period leaves the bears in a torpid state.",
            "My mind felt torpid after the long, boring meeting.",
            "The market remained torpid despite the new economic policies."
        ]
    },
    {
        "word": "languid",
        "type": "adj",
        "definition": "displaying or having a disinclination for physical exertion or effort; slow and relaxed",
        "cefr_level": "C2+",
        "examples": [
            "She lay on the sofa in a languid pose.",
            "The conversation was languid, drifting from one topic to another without purpose.",
            "A languid wave of the hand was his only greeting."
        ]
    },
    {
        "word": "somnolent",
        "type": "adj",
        "definition": "sleepy; drowsy",
        "cefr_level": "C2+",
        "examples": [
            "The heavy meal and warm room made him feel somnolent.",
            "It was a quiet, somnolent village where nothing ever happened.",
            "The medication has a somnolent effect."
        ]
    },
    {
        "word": "soporific",
        "type": "adj",
        "definition": "tending to induce drowsiness or sleep",
        "cefr_level": "C2+",
        "examples": [
            "The professor's monotonous voice was soporific.",
            "Whatever was in that tea had a soporific effect on me.",
            "The heat of the afternoon was soporific."
        ]
    },
    {
        "word": "ebullient",
        "type": "adj",
        "definition": "cheerful and full of energy",
        "cefr_level": "C2+",
        "examples": [
            "She was in an ebullient mood after passing her exams.",
            "His ebullient personality makes him a great team leader.",
            "The crowd was ebullient as their team scored the winning goal."
        ]
    },
    {
        "word": "pithy",
        "type": "adj",
        "definition": "(of language or style) concise and forcefully expressive",
        "cefr_level": "C2+",
        "examples": [
            "He replied with a pithy comment that silenced his critics.",
            "Her reviews are always pithy and to the point.",
            "The headline was a pithy summary of the article."
        ]
    },
    {
        "word": "laconic",
        "type": "adj",
        "definition": "(of a person, speech, or style of writing) using very few words",
        "cefr_level": "C2+",
        "examples": [
            "His laconic reply suggested he was not interested in the conversation.",
            "The Spartans were famous for their laconic speech.",
            "She appreciates his laconic style, as he never wastes time on small talk."
        ]
    },
    {
        "word": "garrulous",
        "type": "adj",
        "definition": "excessively talkative, especially on trivial matters",
        "cefr_level": "C2+",
        "examples": [
            "The garrulous old man told us his life story on the bus.",
            "She became garrulous after a few glasses of wine.",
            "I tried to avoid the garrulous neighbor who always wants to gossip."
        ]
    },
    {
        "word": "loquacious",
        "type": "adj",
        "definition": "tending to talk a great deal; talkative",
        "cefr_level": "C2+",
        "examples": [
            "The loquacious host kept the guests entertained all evening.",
            "He is a loquacious parrot who mimics everything he hears.",
            "Her loquacious nature makes her well-suited for a career in sales."
        ]
    },
    {
        "word": "taciturn",
        "type": "adj",
        "definition": "(of a person) reserved or uncommunicative in speech; saying little",
        "cefr_level": "C2+",
        "examples": [
            "He is a taciturn man who rarely speaks unless spoken to.",
            "Her taciturn father expressed his love through actions rather than words.",
            "The meeting was awkward due to the taciturn nature of the negotiators."
        ]
    },
    {
        "word": "reticent",
        "type": "adj",
        "definition": "not revealing one's thoughts or feelings readily",
        "cefr_level": "C2+",
        "examples": [
            "She was reticent about her past, refusing to answer personal questions.",
            "He is reticent to express his opinion in public.",
            "Despite his fame, the author remains reticent and avoids interviews."
        ]
    },
    {
        "word": "strident",
        "type": "adj",
        "definition": "presenting a point of view, especially a controversial one, in an excessively and unpleasantly forceful way",
        "cefr_level": "C2+",
        "examples": [
            "His strident demands for reform alienated potential allies.",
            "The debate became strident and personal.",
            "She is a strident feminist who fights for gender equality."
        ]
    },
    {
        "word": "vociferous",
        "type": "adj",
        "definition": "(especially of a person or speech) vehement or clamorous",
        "cefr_level": "C2+",
        "examples": [
            "The fans were vociferous in their support of the team.",
            "He was a vociferous critic of the war.",
            "The proposal met with vociferous opposition from the community."
        ]
    },
    {
        "word": "punctilious",
        "type": "adj",
        "definition": "showing great attention to detail or correct behavior",
        "cefr_level": "C2+",
        "examples": [
            "He was punctilious about paying his debts on time.",
            "She is punctilious in observing the rules of etiquette.",
            "The event was organized with punctilious care."
        ]
    },
    {
        "word": "vicissitude",
        "type": "noun",
        "definition": "a change of circumstances or fortune, typically one that is unwelcome or unpleasant",
        "cefr_level": "C2+",
        "examples": [
            "They remained friends through all the vicissitudes of life.",
            "The essay explores the vicissitudes of political power in the 20th century.",
            "He accepted the vicissitudes of his career with remarkable grace."
        ]
    },
    {
        "word": "serendipity",
        "type": "noun",
        "definition": "the occurrence and development of events by chance in a happy or beneficial way",
        "cefr_level": "C2+",
        "examples": [
            "The discovery of penicillin is a famous example of serendipity.",
            "It was pure serendipity that we met at the airport right before the flight.",
            "A stroke of serendipity led him to find the rare book in a dusty attic."
        ]
    },
    {
        "word": "ephemera",
        "type": "noun",
        "definition": "things that exist or are used or enjoyed for only a short time",
        "cefr_level": "C2+",
        "examples": [
            "The museum collects Victorian ephemera like tickets, pamphlets, and posters.",
            "He realized that social media fame is merely digital ephemera.",
            "She has a fascination with the ephemera of daily life in the 1950s."
        ]
    },
    {
        "word": "panacea",
        "type": "noun",
        "definition": "a solution or remedy for all difficulties or diseases",
        "cefr_level": "C2+",
        "examples": [
            "Technology is often presented as a panacea for all our problems.",
            "There is no simple panacea for the country's economic woes.",
            "Education is crucial, but it is not a panacea for social inequality."
        ]
    },
    {
        "word": "zeitgeist",
        "type": "noun",
        "definition": "the defining spirit or mood of a particular period of history as shown by the ideas and beliefs of the time",
        "cefr_level": "C2+",
        "examples": [
            "The movie perfectly captured the zeitgeist of the late 1960s.",
            "His novels are popular because they tap into the current cultural zeitgeist.",
            "Understanding the zeitgeist is essential for successful marketing."
        ]
    },
    {
        "word": "schadenfreude",
        "type": "noun",
        "definition": "pleasure derived by someone from another person's misfortune",
        "cefr_level": "C2+",
        "examples": [
            "He felt a shameful pang of schadenfreude when his rival's business failed.",
            "Political satire often relies on a sense of collective schadenfreude.",
            "She tried to hide her schadenfreude when the arrogant celebrity tripped on the red carpet."
        ]
    },
    {
        "word": "ennui",
        "type": "noun",
        "definition": "a feeling of listlessness and dissatisfaction arising from a lack of occupation or excitement",
        "cefr_level": "C2+",
        "examples": [
            "He suffered from a deep sense of ennui during the long summer holiday.",
            "The characters in the novel are trapped in a state of existential ennui.",
            "She tried to dispel her ennui by taking up painting."
        ]
    },
    {
        "word": "imbroglio",
        "type": "noun",
        "definition": "an extremely confused, complicated, or embarrassing situation",
        "cefr_level": "C2+",
        "examples": [
            "The government tried to distance itself from the diplomatic imbroglio.",
            "He found himself entangled in a legal imbroglio over the inheritance.",
            "The misunderstanding escalated into a public imbroglio."
        ]
    },
    {
        "word": "dilettante",
        "type": "noun",
        "definition": "a person who cultivates an area of interest, such as the arts, without real commitment or knowledge",
        "cefr_level": "C2+",
        "examples": [
            "He dismissed the critic as a mere dilettante with no real understanding of music.",
            "She dabbles in painting and poetry, but she is essentially a dilettante.",
            "The conference was full of serious scholars, not dilettantes."
        ]
    },
    {
        "word": "sycophant",
        "type": "noun",
        "definition": "a person who acts obsequiously toward someone important in order to gain advantage",
        "cefr_level": "C2+",
        "examples": [
            "The dictator was surrounded by sycophants who agreed with everything he said.",
            "She realized that his compliments were those of a sycophant.",
            "He is a shameless sycophant, always seeking the boss's favor."
        ]
    },
    {
        "word": "demagogue",
        "type": "noun",
        "definition": "a political leader who seeks support by appealing to the desires and prejudices of ordinary people rather than by using rational argument",
        "cefr_level": "C2+",
        "examples": [
            "The demagogue stirred up the crowd with angry rhetoric.",
            "History warns us against the rise of demagogues in times of crisis.",
            "His speech was typical of a demagogue, full of empty promises and fear-mongering."
        ]
    },
    {
        "word": "iconoclast",
        "type": "noun",
        "definition": "a person who attacks cherished beliefs or institutions",
        "cefr_level": "C2+",
        "examples": [
            "As an iconoclast, he enjoyed challenging the traditions of the art world.",
            "The company founder was an iconoclast who revolutionized the industry.",
            "She is an iconoclast who refuses to follow the beaten path."
        ]
    },
    {
        "word": "pariah",
        "type": "noun",
        "definition": "an outcast",
        "cefr_level": "C2+",
        "examples": [
            "After the scandal, he became a pariah in the business community.",
            "The country was treated as a pariah state by the international community.",
            "She felt like a pariah at the new school."
        ]
    },
    {
        "word": "misnomer",
        "type": "noun",
        "definition": "a wrong or inaccurate name or designation",
        "cefr_level": "C2+",
        "examples": [
            "The term 'jellyfish' is a misnomer; they are not actually fish.",
            "Calling this chaotic event a 'ceremony' is a bit of a misnomer.",
            "It is a misnomer to call him a 'peacekeeper' given his violent history."
        ]
    },
    {
        "word": "anachronism",
        "type": "noun",
        "definition": "a thing belonging or appropriate to a period other than that in which it exists, especially a thing that is conspicuously old-fashioned",
        "cefr_level": "C2+",
        "examples": [
            "The monarchy is seen by some as an anachronism in the modern world.",
            "In the age of email, the fax machine is becoming an anachronism.",
            "The film was full of historical anachronisms, like a wristwatch in Roman times."
        ]
    },
    {
        "word": "platitude",
        "type": "noun",
        "definition": "a remark or statement, especially one with a moral content, that has been used too often to be interesting or thoughtful",
        "cefr_level": "C2+",
        "examples": [
            "His speech was full of empty platitudes about hard work and success.",
            "We need concrete plans, not just political platitudes.",
            "She responded to my grief with a few well-meaning platitudes."
        ]
    },
    {
        "word": "sinecure",
        "type": "noun",
        "definition": "a position requiring little or no work but giving the holder status or financial benefit",
        "cefr_level": "C2+",
        "examples": [
            "The job was a sinecure, involving nothing more than attending a few meetings a year.",
            "He hoped to find a sinecure that would allow him time to write his book.",
            "Critics argued that the board positions were mere sinecures for retired politicians."
        ]
    },
    {
        "word": "diatribe",
        "type": "noun",
        "definition": "a forceful and bitter verbal attack against someone or something",
        "cefr_level": "C2+",
        "examples": [
            "He launched into a long diatribe against the government's economic policies.",
            "Her article was a furious diatribe against consumer culture.",
            "I was forced to listen to his diatribe about the younger generation."
        ]
    },
    {
        "word": "peccadillo",
        "type": "noun",
        "definition": "a small, relatively unimportant offense or sin",
        "cefr_level": "C2+",
        "examples": [
            "Compared to his opponent's crimes, his actions were mere peccadilloes.",
            "She was willing to overlook his minor peccadilloes.",
            "The media focused on the politician's peccadilloes rather than his policies."
        ]
    },
    {
        "word": "penchant",
        "type": "noun",
        "definition": "a strong or habitual liking for something or tendency to do something",
        "cefr_level": "C2+",
        "examples": [
            "He has a penchant for expensive sports cars.",
            "She has a penchant for adopting stray animals.",
            "His penchant for exaggeration makes his stories entertaining but unreliable."
        ]
    },
    {
        "word": "predilection",
        "type": "noun",
        "definition": "a preference or special liking for something; a bias in favor of something",
        "cefr_level": "C2+",
        "examples": [
            "She has a predilection for classical music.",
            "His predilection for spicy food is well known.",
            "The author shows a predilection for tragic endings."
        ]
    },
    {
        "word": "proclivity",
        "type": "noun",
        "definition": "a tendency to choose or do something regularly; an inclination or predisposition toward a particular thing",
        "cefr_level": "C2+",
        "examples": [
            "He has a proclivity for hard work and discipline.",
            "The study examined the genetic proclivity for addiction.",
            "Her proclivity to worry about details makes her a great editor."
        ]
    },
    {
        "word": "idiosyncrasy",
        "type": "noun",
        "definition": "a mode of behavior or way of thought peculiar to an individual",
        "cefr_level": "C2+",
        "examples": [
            "One of his idiosyncrasies is talking to his plants.",
            "The car has a few idiosyncrasies that you have to get used to.",
            "She accepted his idiosyncrasies as part of his charm."
        ]
    },
    {
        "word": "hegemony",
        "type": "noun",
        "definition": "leadership or dominance, especially by one country or social group over others",
        "cefr_level": "C2+",
        "examples": [
            "The war was fought to challenge the hegemony of the empire.",
            "Cultural hegemony can be just as powerful as military force.",
            "The company maintained its hegemony in the software market for decades."
        ]
    },
    {
        "word": "oligarchy",
        "type": "noun",
        "definition": "a small group of people having control of a country, organization, or institution",
        "cefr_level": "C2+",
        "examples": [
            "The country is ruled by an oligarchy of wealthy families.",
            "Critics argue that the corporation operates like an oligarchy.",
            "The revolution aimed to overthrow the corrupt oligarchy."
        ]
    },
    {
        "word": "nepotism",
        "type": "noun",
        "definition": "the practice among those with power or influence of favoring relatives or friends, especially by giving them jobs",
        "cefr_level": "C2+",
        "examples": [
            "He was accused of nepotism when he promoted his nephew to manager.",
            "Nepotism is rampant in the local government.",
            "The company has strict policies to prevent nepotism."
        ]
    },
    {
        "word": "kakistocracy",
        "type": "noun",
        "definition": "government by the least suitable or competent citizens of a state",
        "cefr_level": "C2+",
        "examples": [
            "The editorial described the current administration as a kakistocracy.",
            "He fears the nation is sliding into a kakistocracy.",
            "When unqualified leaders take charge, democracy becomes a kakistocracy."
        ]
    },
    {
        "word": "anomaly",
        "type": "noun",
        "definition": "something that deviates from what is standard, normal, or expected",
        "cefr_level": "C2+",
        "examples": [
            "The snow in July was a weather anomaly.",
            "There are several anomalies in the tax records.",
            "She is an anomaly in the world of politicshonest and humble."
        ]
    },
    {
        "word": "aberration",
        "type": "noun",
        "definition": "a departure from what is normal, usual, or expected, typically one that is unwelcome",
        "cefr_level": "C2+",
        "examples": [
            "His violent outburst was an aberration; he is usually very calm.",
            "The chromosomal aberration was responsible for the disease.",
            "We considered the poor sales figures to be a temporary aberration."
        ]
    },
    {
        "word": "turpitude",
        "type": "noun",
        "definition": "depravity; wickedness",
        "cefr_level": "C2+",
        "examples": [
            "He was convicted of crimes involving moral turpitude.",
            "The novel exposes the turpitude of the upper classes.",
            "Acts of moral turpitude can be grounds for disbarment."
        ]
    },
    {
        "word": "epiphany",
        "type": "noun",
        "definition": "a moment of sudden revelation or insight",
        "cefr_level": "C2+",
        "examples": [
            "She had an epiphany and realized she was in the wrong career.",
            "The solution to the problem came to him in a sudden epiphany.",
            "Joyce's stories often center around a character's personal epiphany."
        ]
    },
    {
        "word": "euphemism",
        "type": "noun",
        "definition": "a mild or indirect word or expression substituted for one considered to be too harsh or blunt",
        "cefr_level": "C2+",
        "examples": [
            "\"Passed away\" is a common euphemism for \"died\".",
            "The company used the euphemism \"downsizing\" to describe the mass firings.",
            "Political language is often filled with euphemisms to hide unpleasant truths."
        ]
    },
    {
        "word": "hyperbole",
        "type": "noun",
        "definition": "exaggerated statements or claims not meant to be taken literally",
        "cefr_level": "C2+",
        "examples": [
            "He is prone to hyperbole; I wouldn't take his stories too seriously.",
            "The advertisement was full of hyperbole about the product's miraculous effects.",
            "\"I've been waiting forever\" is an example of hyperbole."
        ]
    },
    {
        "word": "juxtaposition",
        "type": "noun",
        "definition": "the fact of two things being seen or placed close together with contrasting effect",
        "cefr_level": "C2+",
        "examples": [
            "The juxtaposition of wealth and poverty in the city is striking.",
            "Her art relies on the juxtaposition of organic and mechanical forms.",
            "The director used the juxtaposition of silence and loud noise to create tension."
        ]
    },
    {
        "word": "zenith",
        "type": "noun",
        "definition": "the time at which something is most powerful or successful",
        "cefr_level": "C2+",
        "examples": [
            "At the zenith of his career, he was the most famous actor in the world.",
            "The Roman Empire reached its zenith in the second century AD.",
            "The sun reached its zenith at noon."
        ]
    },
    {
        "word": "nadir",
        "type": "noun",
        "definition": "the lowest point in the fortunes of a person or organization",
        "cefr_level": "C2+",
        "examples": [
            "His career reached its nadir when he was fired from his first job.",
            "The relationship between the two countries is at its nadir.",
            "That scandal was the nadir of his presidency."
        ]
    },
    {
        "word": "epitome",
        "type": "noun",
        "definition": "a person or thing that is a perfect example of a particular quality or type",
        "cefr_level": "C2+",
        "examples": [
            "She is the epitome of elegance and grace.",
            "The old factory is the epitome of industrial decline.",
            "His behavior was the epitome of selfishness."
        ]
    },
    {
        "word": "quintessence",
        "type": "noun",
        "definition": "the most perfect or typical example of a quality or class",
        "cefr_level": "C2+",
        "examples": [
            "He was the quintessence of a British gentleman.",
            "This painting captures the quintessence of the Impressionist movement.",
            "Compassion is the quintessence of her character."
        ]
    },
    {
        "word": "antithesis",
        "type": "noun",
        "definition": "a person or thing that is the direct opposite of someone or something else",
        "cefr_level": "C2+",
        "examples": [
            "His lifestyle is the antithesis of everything I believe in.",
            "Love is the antithesis of selfishness.",
            "The new policy is the complete antithesis of the old one."
        ]
    },
    {
        "word": "anathema",
        "type": "noun",
        "definition": "something or someone that one vehemently dislikes",
        "cefr_level": "C2+",
        "examples": [
            "The idea of higher taxes is anathema to most conservatives.",
            "Violence was anathema to her pacifist principles.",
            "Meat is anathema to a strict vegan."
        ]
    },
    {
        "word": "litany",
        "type": "noun",
        "definition": "a tedious recital or repetitive series",
        "cefr_level": "C2+",
        "examples": [
            "He recited a litany of complaints about his job.",
            "The meeting was just a litany of excuses for the project's failure.",
            "She faced a litany of medical problems in her old age."
        ]
    },
    {
        "word": "alacrity",
        "type": "noun",
        "definition": "brisk and cheerful readiness",
        "cefr_level": "C2+",
        "examples": [
            "She accepted the invitation with alacrity.",
            "He attacked the job with alacrity and finished it in record time.",
            "We were surprised by the alacrity with which he agreed to help."
        ]
    },
    {
        "word": "veracity",
        "type": "noun",
        "definition": "conformity to facts; accuracy",
        "cefr_level": "C2+",
        "examples": [
            "The police doubted the veracity of his statement.",
            "We need to check the veracity of these documents before publishing.",
            "Her reputation for veracity made her a credible witness."
        ]
    },
    {
        "word": "probity",
        "type": "noun",
        "definition": "the quality of having strong moral principles; honesty and decency",
        "cefr_level": "C2+",
        "examples": [
            "The committee is looking for a person of unquestioned probity.",
            "Financial probity is essential for a public official.",
            "His probity was never in doubt, even among his enemies."
        ]
    },
    {
        "word": "mendacity",
        "type": "noun",
        "definition": "untruthfulness",
        "cefr_level": "C2+",
        "examples": [
            "The article exposed the mendacity of the government's claims.",
            "He is known for his mendacity; don't believe a word he says.",
            "Politics is often associated with manipulation and mendacity."
        ]
    },
    {
        "word": "enigma",
        "type": "noun",
        "definition": "a person or thing that is mysterious, puzzling, or difficult to understand",
        "cefr_level": "C2+",
        "examples": [
            "The reason for his sudden departure remains an enigma.",
            "She is an enigma to me; I never know what she is thinking.",
            "The Mona Lisa's smile is a famous artistic enigma."
        ]
    },
    {
        "word": "conundrum",
        "type": "noun",
        "definition": "a confusing and difficult problem or question",
        "cefr_level": "C2+",
        "examples": [
            "The government is facing a difficult economic conundrum.",
            "He is faced with the moral conundrum of whether to report his friend.",
            "The solution to this conundrum is not immediately obvious."
        ]
    },
    {
        "word": "debacle",
        "type": "noun",
        "definition": "a sudden and ignominious failure; a fiasco",
        "cefr_level": "C2+",
        "examples": [
            "The product launch was a complete debacle.",
            "The government collapsed after the economic debacle.",
            "He tried to forget the debacle of his first public speech."
        ]
    },
    {
        "word": "fiasco",
        "type": "noun",
        "definition": "a thing that is a complete failure, especially in a ludicrous or humiliating way",
        "cefr_level": "C2+",
        "examples": [
            "The party was a total fiasco; the food was cold and the music was terrible.",
            "The diplomatic mission ended in a fiasco.",
            "What should have been a simple repair turned into a fiasco."
        ]
    },
    {
        "word": "lassitude",
        "type": "noun",
        "definition": "a state of physical or mental weariness; lack of energy",
        "cefr_level": "C2+",
        "examples": [
            "She was overcome by a feeling of lassitude after the long illness.",
            "The hot weather induced a pleasant lassitude.",
            "His depression was marked by extreme lassitude and apathy."
        ]
    },
    {
        "word": "opulence",
        "type": "noun",
        "definition": "great wealth or luxuriousness",
        "cefr_level": "C2+",
        "examples": [
            "The palace was decorated with incredible opulence.",
            "He lived a life of opulence and excess.",
            "The opulence of the hotel lobby was breathtaking."
        ]
    },
    {
        "word": "penury",
        "type": "noun",
        "definition": "extreme poverty; destitution",
        "cefr_level": "C2+",
        "examples": [
            "He died in penury, forgotten by the world.",
            "The war reduced the population to penury.",
            "She rose from penury to become a wealthy entrepreneur."
        ]
    },
    {
        "word": "munificence",
        "type": "noun",
        "definition": "the quality or action of being lavishly generous; great generosity",
        "cefr_level": "C2+",
        "examples": [
            "The library was built thanks to the munificence of a local donor.",
            "We were overwhelmed by the munificence of the host.",
            "His munificence helped many students attend college."
        ]
    },
    {
        "word": "misanthrope",
        "type": "noun",
        "definition": "a person who dislikes humankind and avoids human society",
        "cefr_level": "C2+",
        "examples": [
            "After the betrayal, he became a bitter misanthrope.",
            "The old man was a misanthrope who shouted at anyone who came near his house.",
            "Scrooge is a classic literary example of a misanthrope."
        ]
    },
    {
        "word": "philistine",
        "type": "noun",
        "definition": "a person who is hostile or indifferent to culture and the arts",
        "cefr_level": "C2+",
        "examples": [
            "Don't be such a philistine; try to appreciate the opera.",
            "He dismissed the critics as a bunch of uneducated philistines.",
            "She accused him of being a philistine who only cares about money."
        ]
    },
    {
        "word": "hedonist",
        "type": "noun",
        "definition": "a person who believes that the pursuit of pleasure is the most important thing in life",
        "cefr_level": "C2+",
        "examples": [
            "As a hedonist, he spent all his money on travel and fine dining.",
            "The novel portrays the empty life of a wealthy hedonist.",
            "She rejected the hedonist lifestyle in favor of simplicity."
        ]
    },
    {
        "word": "ascetic",
        "type": "noun",
        "definition": "a person who practices severe self-discipline and abstention",
        "cefr_level": "C2+",
        "examples": [
            "He lived as an ascetic, owning nothing but a few books.",
            "The ascetic monk fasted for weeks at a time.",
            "Her apartment was simple and bare, reflecting her ascetic nature."
        ]
    },
    {
        "word": "symbiosis",
        "type": "noun",
        "definition": "interaction between two different organisms living in close physical association, typically to the advantage of both",
        "cefr_level": "C2+",
        "examples": [
            "The birds and the cattle have a perfect symbiosis.",
            "There is a symbiosis between the university and the local tech industry.",
            "The two companies operate in a profitable symbiosis."
        ]
    },
    {
        "word": "osmosis",
        "type": "noun",
        "definition": "the process of gradual or unconscious assimilation of ideas, knowledge, etc.",
        "cefr_level": "C2+",
        "examples": [
            "I learned Spanish by osmosis while living in Mexico.",
            "He hopes to acquire wisdom by osmosis from his mentors.",
            "Cultural values are often transmitted through a process of osmosis."
        ]
    },
    {
        "word": "catalyst",
        "type": "noun",
        "definition": "a person or thing that precipitates an event",
        "cefr_level": "C2+",
        "examples": [
            "The protest was the catalyst for major political change.",
            "She served as a catalyst for innovation within the company.",
            "The assassination was the catalyst that started the war."
        ]
    },
    {
        "word": "apotheosis",
        "type": "noun",
        "definition": "the highest point in the development of something; culmination or climax",
        "cefr_level": "C2+",
        "examples": [
            "The concert was the apotheosis of his musical career.",
            "For many, the Victorian era represents the apotheosis of the British Empire.",
            "Her performance was the apotheosis of elegance and skill."
        ]
    },
    {
        "word": "catharsis",
        "type": "noun",
        "definition": "the process of releasing, and thereby providing relief from, strong or repressed emotions",
        "cefr_level": "C2+",
        "examples": [
            "Writing his memoir was a form of catharsis for the trauma he endured.",
            "Greek tragedies were designed to induce catharsis in the audience.",
            "She felt a sense of catharsis after finally confronting her boss."
        ]
    },
    {
        "word": "nemesis",
        "type": "noun",
        "definition": "the inescapable agent of someone's or something's downfall",
        "cefr_level": "C2+",
        "examples": [
            "In the final act, the villain meets his nemesis.",
            "Mathematics has always been my nemesis in school.",
            "Hubris often proves to be the nemesis of great leaders."
        ]
    },
    {
        "word": "plethora",
        "type": "noun",
        "definition": "a large or excessive amount of (something)",
        "cefr_level": "C2+",
        "examples": [
            "There is a plethora of diet books on the market, but few are effective.",
            "The report contains a plethora of data but lacks actionable insights.",
            "We were overwhelmed by the plethora of choices at the buffet."
        ]
    },
    {
        "word": "dearth",
        "type": "noun",
        "definition": "a scarcity or lack of something",
        "cefr_level": "C2+",
        "examples": [
            "There is a dearth of affordable housing in the city.",
            "The dearth of evidence made it impossible to convict the suspect.",
            "His speech revealed a dearth of original ideas."
        ]
    },
    {
        "word": "paucity",
        "type": "noun",
        "definition": "the presence of something only in small or insufficient quantities or amounts",
        "cefr_level": "C2+",
        "examples": [
            "The paucity of information led to wild speculation.",
            "He was disappointed by the paucity of the audience at his lecture.",
            "Critics pointed out the paucity of female characters in the film."
        ]
    },
    {
        "word": "surfeit",
        "type": "noun",
        "definition": "an excessive amount of something",
        "cefr_level": "C2+",
        "examples": [
            "A surfeit of food and drink left the guests feeling lethargic.",
            "The public is suffering from a surfeit of bad news.",
            "He has a surfeit of confidence but a lack of competence."
        ]
    },
    {
        "word": "panoply",
        "type": "noun",
        "definition": "a complete or impressive collection of things",
        "cefr_level": "C2+",
        "examples": [
            "The king appeared in the full panoply of his regalia.",
            "The company offers a panoply of services for small businesses.",
            "We were greeted by a panoply of colors and sounds at the festival."
        ]
    },
    {
        "word": "dichotomy",
        "type": "noun",
        "definition": "a division or contrast between two things that are or are represented as being opposed or entirely different",
        "cefr_level": "C2+",
        "examples": [
            "The essay explores the dichotomy between nature and nurture.",
            "There is often a dichotomy between what politicians say and what they do.",
            "The strict dichotomy of good and evil is rarely found in real life."
        ]
    },
    {
        "word": "schism",
        "type": "noun",
        "definition": "a split or division between strongly opposed sections or parties, caused by differences in opinion or belief",
        "cefr_level": "C2+",
        "examples": [
            "The debate over slavery caused a deep schism in the church.",
            "A schism within the political party led to the formation of a new faction.",
            "The Great Schism of 1054 divided Christianity into East and West."
        ]
    },
    {
        "word": "celerity",
        "type": "noun",
        "definition": "swiftness of movement",
        "cefr_level": "C2+",
        "examples": [
            "The firefighters responded with remarkable celerity.",
            "He moved with the celerity of a gazelle.",
            "The celerity of the virus's spread alarmed health officials."
        ]
    },
    {
        "word": "temerity",
        "type": "noun",
        "definition": "excessive confidence or boldness; audacity",
        "cefr_level": "C2+",
        "examples": [
            "He had the temerity to ask for a raise after losing a major client.",
            "I can't believe she had the temerity to criticize the boss in public.",
            "No one had the temerity to question his authority."
        ]
    },
    {
        "word": "asperity",
        "type": "noun",
        "definition": "harshness of tone or manner",
        "cefr_level": "C2+",
        "examples": [
            "\"Don't be ridiculous,\" he said with some asperity.",
            "She spoke with asperity, revealing her frustration.",
            "The asperity of the criticism took him by surprise."
        ]
    },
    {
        "word": "acrimony",
        "type": "noun",
        "definition": "bitterness or ill feeling",
        "cefr_level": "C2+",
        "examples": [
            "The divorce was settled without acrimony.",
            "The meeting ended in acrimony and name-calling.",
            "There is a history of acrimony between the two rival teams."
        ]
    },
    {
        "word": "amity",
        "type": "noun",
        "definition": "a friendly relationship",
        "cefr_level": "C2+",
        "examples": [
            "The treaty ushered in an era of amity between the two nations.",
            "They lived in perfect amity with their neighbors for years.",
            "The spirit of amity was palpable at the reunion."
        ]
    },
    {
        "word": "levity",
        "type": "noun",
        "definition": "humor or frivolity, especially the treatment of a serious matter with humor or in a manner lacking due respect",
        "cefr_level": "C2+",
        "examples": [
            "He tried to inject some levity into the somber proceedings.",
            "The teacher frowned upon such levity during the exam.",
            "Her remarks were dismissed as mere levity."
        ]
    },
    {
        "word": "brevity",
        "type": "noun",
        "definition": "concise and exact use of words in writing or speech",
        "cefr_level": "C2+",
        "examples": [
            "The brevity of his speech was appreciated by the audience.",
            "Brevity is the soul of wit.",
            "For the sake of brevity, I will summarize the main points."
        ]
    },
    {
        "word": "propriety",
        "type": "noun",
        "definition": "the state or quality of conforming to conventionally accepted standards of behavior or morals",
        "cefr_level": "C2+",
        "examples": [
            "She always behaves with the utmost propriety.",
            "He questioned the propriety of the director accepting such an expensive gift.",
            "They were careful to observe the proprieties of the occasion."
        ]
    },
    {
        "word": "decorum",
        "type": "noun",
        "definition": "behavior in keeping with good taste and propriety",
        "cefr_level": "C2+",
        "examples": [
            "The debate was conducted with dignity and decorum.",
            "He lost his temper and abandoned all sense of decorum.",
            "A breach of decorum can be fatal in diplomatic circles."
        ]
    },
    {
        "word": "sagacity",
        "type": "noun",
        "definition": "the quality of having or showing keen mental discernment and good judgment; wisdom",
        "cefr_level": "C2+",
        "examples": [
            "He was a man of great political sagacity.",
            "Her business sagacity helped the company navigate the crisis.",
            "We relied on his sagacity to resolve the dispute."
        ]
    },
    {
        "word": "perspicacity",
        "type": "noun",
        "definition": "the quality of having a ready insight into things; shrewdness",
        "cefr_level": "C2+",
        "examples": [
            "The novel is admired for its psychological perspicacity.",
            "Her perspicacity allowed her to see through his lies immediately.",
            "He analyzed the market trends with remarkable perspicacity."
        ]
    },
    {
        "word": "acumen",
        "type": "noun",
        "definition": "the ability to make good judgments and quick decisions, typically in a particular domain",
        "cefr_level": "C2+",
        "examples": [
            "She has considerable business acumen.",
            "His legal acumen won him the case.",
            "Lacking financial acumen, he lost his inheritance quickly."
        ]
    },
    {
        "word": "ingenuity",
        "type": "noun",
        "definition": "the quality of being clever, original, and inventive",
        "cefr_level": "C2+",
        "examples": [
            "The problem was solved with typical human ingenuity.",
            "I admire the ingenuity of the device's design.",
            "It took some ingenuity to fit all the furniture into the small room."
        ]
    },
    {
        "word": "parsimony",
        "type": "noun",
        "definition": "extreme unwillingness to spend money or use resources",
        "cefr_level": "C2+",
        "examples": [
            "His parsimony is legendary; he even reuses tea bags.",
            "Due to government parsimony, the project was underfunded.",
            "The law of parsimony suggests the simplest explanation is usually the best."
        ]
    },
    {
        "word": "iniquity",
        "type": "noun",
        "definition": "immoral or grossly unfair behavior",
        "cefr_level": "C2+",
        "examples": [
            "The prophet preached against the iniquity of the city.",
            "He believed that the tax system was full of iniquity.",
            "It is a den of iniquity where gambling and vice flourish."
        ]
    },
    {
        "word": "depravity",
        "type": "noun",
        "definition": "moral corruption; wickedness",
        "cefr_level": "C2+",
        "examples": [
            "The judge was shocked by the sheer depravity of the crime.",
            "He sank into a life of depravity and drug addiction.",
            "The novel explores the depths of human depravity."
        ]
    },
    {
        "word": "perfidy",
        "type": "noun",
        "definition": "deceitfulness; untrustworthiness",
        "cefr_level": "C2+",
        "examples": [
            "The act of betrayal was a monstrous perfidy.",
            "He was punished for his perfidy towards his king.",
            "History remembers him for his treachery and perfidy."
        ]
    },
    {
        "word": "chicanery",
        "type": "noun",
        "definition": "the use of trickery to achieve a political, financial, or legal purpose",
        "cefr_level": "C2+",
        "examples": [
            "He resorted to legal chicanery to avoid paying the fine.",
            "The election was marred by allegations of political chicanery.",
            "She saw through his financial chicanery and refused to invest."
        ]
    },
    {
        "word": "subterfuge",
        "type": "noun",
        "definition": "deceit used in order to achieve one's goal",
        "cefr_level": "C2+",
        "examples": [
            "He had to use subterfuge to get the secret documents out of the building.",
            "The journalist used subterfuge to gain access to the restricted area.",
            "She obtained the information through lies and subterfuge."
        ]
    },
    {
        "word": "duplicity",
        "type": "noun",
        "definition": "deceitfulness; double-dealing",
        "cefr_level": "C2+",
        "examples": [
            "His duplicity was revealed when his secret emails were leaked.",
            "She was accused of duplicity for playing both sides against each other.",
            "I cannot trust a man capable of such duplicity."
        ]
    }
]